* Tasks
** TODO seer -> seer migration

*** TODO Migrate to docket
**** DONE Write docket and bill
:LOGBOOK:
CLOCK: [2021-09-13 Mon 12:57]--[2021-09-13 Mon 16:23] =>  3:26
:END:
**** TODO Make glob
**** TODO Clarify eyre bindings
**** TODO Remove file-server
**** TODO Remove launch actions
**** TODO Update state
**** TODO Make changes to docket

***** NEXT Store glob in spot
:LOGBOOK:
CLOCK: [2021-10-25 Mon 16:16]--[2021-10-28 Thu 16:58] => 72:42
CLOCK: [2021-10-25 Mon 15:58]--[2021-10-25 Mon 16:04] =>  0:06
CLOCK: [2021-10-25 Mon 10:53]--[2021-10-25 Mon 15:57] =>  5:04
:END:
instead of  storing the glob reference in the =href= of the docket structure, we should
store it in =spot= and populate a =chad= from there. this means adding a new
attribute to the docket mold called =spot= and modifying lib/docket
accordingly.

=chad= will still hold the actual glob, and the structure of the docket file
itself will remain unchanged.

* Install
:PROPERTIES:
:header-args+: :dir /home/jake/vault/projects/urbit/git/urbit/
:header-args:sh+: :var desk='distem-bottus-littel-wolfur
:END:
** unix install
Copy into the urbit/urbit repo so that dependencies can be symlinked without
messing with the app source.

#+begin_src sh
ls ./pkg
#+end_src

#+results:
| arvo              |
| base-dev          |
| bitcoin           |
| btc-wallet        |
| docker-image      |
| ent               |
| garden            |
| garden-dev        |
| grid              |
| herb              |
| hs                |
| interface         |
| landscape         |
| npm               |
| seer              |
| symbolic-merge.sh |
| urbit             |
| urcrypt           |
| webterm           |

#+begin_src sh :results none
watch cp -RL /home/jake/vault/projects/srrs/desk/* ./pkg/seer/
watch cp -RL ./pkg/seer/* /mnt/laptop-sandisk/$desk/seer/
#+end_src

#+begin_src sh
# Assumes you are in the urbit/urbit git repo
cd pkg
# rm -rf ./seer/*
# cp -R ~/vault/projects/seer/urbit/* ./seer
./symbolic-merge.sh ./garden-dev ./seer # for docket agent
./symbolic-merge.sh ./landscape ./seer # for stuff like group-store
#+end_src

#+results:

#+begin_src sh
ls ./pkg/seer
#+end_src

Metadata files

#+begin_src sh :results none
cp -Rn pkg/seer/desk.* /mnt/laptop-sandisk/$desk/seer/
cp -Rn pkg/seer/sys.kelvin /mnt/laptop-sandisk/$desk/seer/
#+end_src

Source files. Ensure we don't accidently include files we do not have marks for.

#+begin_src sh :results none
cd pkg/seer

find -L -type f \( -name \*.hoon\* -o -name \*.png\* -o -name \*.html\* -o -name \*.js\* \) -exec cp -v --parents -RL {} /mnt/laptop-sandisk/$desk/seer \;
#+end_src



** Initial Setup
*** urbit install
create new desk and mount.
#+begin_src tmux
|merge %seer our %base
|mount %seer
#+end_src

symlink the garden dev and landscape desk into the seer desk.

#+begin_src sh
cd pkg
./symbolic-merge.sh ./garden-dev ./seer
./symbolic-merge.sh ./landscape ./seer
#+end_src

#+results:

Remove files from seer desk
#+begin_src sh :results none
rm -rf /mnt/laptop-sandisk/$desk/seer/*
#+end_src


copy metadata files into mounted unix path
#+begin_src sh :results none
cp -Rn pkg/seer/desk.* /mnt/laptop-sandisk/$desk/seer/
cp -Rn pkg/seer/sys.kelvin /mnt/laptop-sandisk/$desk/seer/
#+end_src

Copy hoon files into mounted unix path. this is to ensure we don't include files we do not have marks for.

#+begin_src sh :results none
cd pkg/seer

find -L -type f \( -name \*.hoon\* -o -name \*.png\* -o -name \*.html\* -o -name \*.js\* \) -exec cp -v --parents -RL {} /mnt/laptop-sandisk/$desk/seer \;
#+end_src

#+begin_src hoon :session testnet:distem.0
+cat /=seer=/sys/kelvin
+cat /=seer=/desk/docket-0
+ls /=seer=
|commit %seer
#+end_src

#+results:

Run globulator.

switch to the garden desk and publish

#+begin_src tmux
:treaty|garden!publish %seer
#+end_src

install seer
#+begin_src hoon :session testnet:distem.0
|install our %seer
#+end_src

#+results:


*** unix install
Mirror the desk setup found in pkg/<desk>

#+begin_src sh
ls pkg/garden
#+end_src

#+results:
| app           |
| desk.bill     |
| desk.docket-0 |
| desk.ship     |
| gen           |
| lib           |
| mar           |
| sur           |
| sys.kelvin    |
| ted           |
| tests         |

#+begin_src sh
rm -rf ./pkg/seer/*
cp -R ~/vault/projects/seer/desk/* ./pkg/seer
./symbolic-merge.sh ./garden-dev ./pkg/seer
./symbolic-merge.sh ./landscape ./pkg/seer
ls ./pkg/seer/mar
#+end_src

#+begin_src sh
ls pkg/seer/
#+end_src

#+results:
| app           |
| desk.bill     |
| desk.docket-0 |
| gen           |
| lib           |
| mar           |
| sur           |
| sys.kelvin    |
| ted           |
| tests         |

#+begin_src sh
ls ./pkg/seer
#+end_src

#+results:
| app           |
| desk.bill     |
| desk.docket-0 |
| gen           |
| lib           |
| mar           |
| sur           |
| sys.kelvin    |
| ted           |
| tests         |
#+begin_src sh :results none
cp pkg/garden/sys.kelvin ./pkg/seer
cp -Rn pkg/seer/desk.* /mnt/laptop-sandisk/$desk/seer/
cp -Rn pkg/seer/sys.kelvin /mnt/laptop-sandisk/$desk/seer/
#+end_src

Check docket and bill files
#+begin_src zsh :results output replace :dir /mnt/laptop-sandisk/distem-bottus-littel-wolfur/seer/
pwd
cat desk.docket-0
cat desk.bill
#+end_src

#+results:
#+begin_example
/mnt/laptop-sandisk/distem-bottus-littel-wolfur/seer
:~
  title+'Seer'
  info+'urbrain, urbit'
  color+0xee.5432
  version+[0 0 1]
  website+'https://urbit.land'
  license+'MIT'
  base+'seer'
  glob-ames+[~distem-bottus-littel-wolfur 0x0]
==
:~
  %seer
  %seer-cli
==
#+end_example
*** Manifests
:PROPERTIES:
:header-args: :dir /home/jake/vault/projects/urbit/git/urbit/pkg/seer
:END:

Define the docket and the bill for the desk.

#+begin_src hoon :tangle /home/jake/vault/projects/urbit/git/urbit/pkg/seer/desk.docket-0
:~
  title+'Seer'
  info+'urbrain, urbit'
  color+0xee.5432
  version+[0 0 1]
  website+'https://urbit.land'
  license+'MIT'
  base+'seer'
  site+/seer
  glob-http+['https://nyc3.digitaloceanspaces.com/archiv/littel-wolfur/2021.10.11..03.56.09-glob-0v5,8boau,lpf2q,mik4c,oh99p,qko2l.glob' 0v5.8boau.lpf2q.mik4c.oh99p.qko2l]
==
#+end_src
#+begin_src zsh :tangle /home/jake/vault/projects/urbit/git/urbit/pkg/seer/desk.bill
    :~  %seer
        %seer-cli
    ==
#+end_src

#+begin_src sh :results output
cat desk.docket-0
cat desk.bill
#+end_src

#+results:
#+begin_example
:~
  title+'Seer'
  info+'urbrain, urbit'
  color+0xee.5432
  version+[0 0 1]
  website+'https://urbit.land'
  license+'MIT'
  base+'seer'
  site+/seer
  glob-http+['https://nyc3.digitaloceanspaces.com/archiv/littel-wolfur/2021.10.11..03.56.09-glob-0v5,8boau,lpf2q,mik4c,oh99p,qko2l.glob' 0v5.8boau.lpf2q.mik4c.oh99p.qko2l]
==
:~
  %seer
  %seer-cli
==
#+end_example
*** Desk Install
**** Dev install
:PROPERTIES:
:header-args: :dir /home/jake/vault/projects/urbit/git/urbit/
:END:
Do this if not booting with a multi-desk pill containing the necessary desks.

Unmount if necessary.

#+begin_src tmux
|unmount %base-dev
|unmount %garden
|unmount %landscape
#+end_src

Create desks and mount.
#+begin_src tmux
|merge %base-dev our %base
|merge %garden our %base
|merge %landscape our %base
|merge %seer our %base
|mount %base-dev
|mount %garden
|mount %landscape
|mount %seer
#+end_src



#+results:

#+begin_src sh :results none
unalias cp

rm -rf /mnt/laptop-sandisk/$desk/garden/*
rm -rf /mnt/laptop-sandisk/$desk/base/*
yes | cp -RL pkg/garden/* /mnt/laptop-sandisk/$desk/garden/
yes | cp -RL pkg/arvo/* /mnt/laptop-sandisk/$desk/base/
#+end_src
#+begin_src sh :results none
unalias cp
rm -rf /mnt/laptop-sandisk/$desk/seer/*
yes | cp -RL pkg/seer/* /mnt/laptop-sandisk/$desk/seer/
#+end_src
#+begin_src sh
unalias cp
rm -rf /mnt/laptop-sandisk/dop$desk/base/*
yes | cp -RL pkg/arvo/* /mnt/laptop-sandisk/dop$desk/base/
rm -rf /mnt/laptop-sandisk/dop$desk/garden/*
yes | cp -RL pkg/garden/* /mnt/laptop-sandisk/dop$desk/garden/

#+end_src

#+results:

#+begin_src tmux
|commit %base
|commit %garden
#+end_src
#+results:

#+begin_src sh
yes | cp -RL /mnt/laptop-sandisk/$desk-old/base/* /mnt/laptop-sandisk/$desk/base/
yes | cp -RL /mnt/laptop-sandisk/$desk-old/garden/* /mnt/laptop-sandisk/$desk/garden/
#+end_src

#+results:

#+begin_src tmux
|commit %base-dev
|commit %garden
|commit %landscape
|merge %seer our %base-dev
|merge %seer our %landscape
|commit %seer


#+end_src

#+begin_src tmux
=d -build-file /=base-dev=/lib/docket/hoon
=io -build-file /=desk=/lib/agentio/hoon
=desk %garden
=desk %garden
=loc [%ship ~$desk]
=tid (cat 3 'docket-' (scot %uv (sham (mix eny desk)))))
=b *beak
:spider|start %glob !>(`[loc desk])]
:spider|start %glob !>(`[%http])]

#+end_src
#+begin_src tmux
=dir
|commit %garden
=dir /=garden
-glob [[%ames $desk] %seer]
=dir
#+end_src

tadnul-nismyn-dabryn-balhes


*** Changes
- No more chat store
- had to symlink landscape
